////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияПовтИсп: 
// 
// содержит функции, возвращающие часто используемые значения не привязаные 
// к функциональным блокам. 
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, ведётся ли валютный учёт в организации.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - организация, по которой проверяется
//                 ведение валютного учёта.
// Возвращаемое значение:
//   Булево   - если валютный учёт ведётся, то Истина, иначе - Ложь.
//
Функция ВалютныйУчетОрганизации(Организация) Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ВалютныйУчет", Новый Структура("Организация", Организация));

КонецФункции 

#КонецОбласти
