////////////////////////////////////////////////////////////////////////////////
// Общего назначения:
// 
// Содержит переиспользуемые методы общей функциональности.
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Убирает проверку обязательности заполнения валюты, если по организации валютный учёт не ведётся.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - Организация, по которой проверяется
//                 ведение валютного учёта.
//  ПроверяемыеРеквизиты  - Массив - перечень проверяемых реквизитов документа.
//                 Подробнее см. синтаксис-помощник
//
Процедура ОбязательностьВалюты(Организация, ПроверяемыеРеквизиты) Экспорт
	
	Если НЕ ОбщегоНазначенияПовтИсп.ВалютныйУчетОрганизации(Организация) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Валюта"));
	КонецЕсли;	
	
КонецПроцедуры

// Возвращает пустую ссылку, если выбрана группа, или ссылку на элемент справочника.
//
// Параметры:
//  Контрагент  - СправочникСсылка.Контрагенты - проверяемая ссылка.
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты   - результат проверки на группу.
//
Функция КонтрагентПоПереданнойСсылке(Контрагент) Экспорт
	
	КонтрагентПоСсылке = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                           |	Контрагенты.Ссылка
                           |ИЗ
                           |	Справочник.Контрагенты КАК Контрагенты
                           |ГДЕ
                           |	Контрагенты.Ссылка = &КонтрагентСсылка
						   |	И Контрагенты.ЭтоГруппа");
	Запрос.УстановитьПараметр("КонтрагентСсылка", Контрагент);
	РезульатЗапроса = Запрос.Выполнить();
	Если РезульатЗапроса.Пустой() Тогда
		КонтрагентПоСсылке = Контрагент;
	КонецЕсли;
	
	Возврат КонтрагентПоСсылке;
	
КонецФункции

#КонецОбласти

